Revit 2026 API

# FaceComputeNormal Method

---

Returns the normal vector for the face at the given point.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ ComputeNormal(
	UV point
)
```
```vb
Public Function ComputeNormal (
	point As UV
) As XYZ
```
```cpp
public:
XYZ^ ComputeNormal(
	UV^ point
)
```
```fsharp
member ComputeNormal :
        point : UV -> XYZ
```

#### Parameters

point UV
    The parameters to be evaluated, in natural parameterization of the face.

#### Return Value

XYZThe normal vector. This vector will be normalized.

Differs from the normal returned from ComputeDerivatives(UV) in that this vector is the "face normal" vector. It will always be oriented to point out of a solid that contains the face.

#### Reference

Face Class

Autodesk.Revit.DB Namespace